nathanasbury/simple_peripheral/simple_peripheral.syscfg
/*
 * Copyright (c) 2018, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/LP_EM_CC2674P10 --rtos tirtos7

/*
 *  simple_peripheral.syscfg
 */

const lpName = system.getScript("/ti/ble5stack/ble_common.js").getBoardOrLaunchPadName(true);

/* ======== AESCCM ======== */
var AESCCM = scripting.addModule("/ti/drivers/AESCCM");
var aesccm = AESCCM.addInstance();
aesccm.$name = "CONFIG_AESCCM0";

/* ======== AESECB ======== */
var AESECB = scripting.addModule("/ti/drivers/AESECB");
var aesecb = AESECB.addInstance();
aesecb.$name = "CONFIG_AESECB0";

/* ======== ECDH ======== */
var ECDH = scripting.addModule("/ti/drivers/ECDH");
var ecdh = ECDH.addInstance();
ecdh.$name = "CONFIG_ECDH0"

/* ======== AESCTRDRBG ======== */
var AESCTRDRBG = scripting.addModule("/ti/drivers/AESCTRDRBG");
var aesctrdrbg = AESCTRDRBG.addInstance();



/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");

var gpio0 = GPIO.addInstance();
gpio0.mode = "Input";
gpio0.$name = "CONFIG_GPIO_BTN1";
gpio0.gpioPin.$assign = "DIO15";

var gpio1 = GPIO.addInstance();
gpio1.mode = "Input";
gpio1.$name = "CONFIG_GPIO_BTN2";
gpio1.gpioPin.$assign = "DIO20";

var gpio2 = GPIO.addInstance();
gpio2.$name = "CONFIG_GPIO_LED_0";
gpio2.gpioPin.$assign = "DIO22";

var gpio3 = GPIO.addInstance();
gpio3.$name = "CONFIG_GPIO_ADXL_INT";
gpio3.gpioPin.$assign = "DIO10";

var gpio4 = GPIO.addInstance();
gpio4.$name = "CONFIG_GPIO_ADXL_CS";
gpio4.gpioPin.$assign = "DIO11";

var gpio5 = GPIO.addInstance();
gpio5.$name = "CONFIG_GPIO_AFE_INT";
gpio5.gpioPin.$assign = "DIO18";

var gpio6 = GPIO.addInstance();
gpio6.$name = "CONFIG_GPIO_AFE_CS";
gpio6.gpioPin.$assign = "DIO21";

/* ======== SPI ======== */
var SPI = scripting.addModule("/ti/drivers/SPI");

var spi0 = SPI.addInstance();
spi0.$name = "CONFIG_SPI_ACCEL";
spi0.spi.sclkPin.$assign = "DIO14";
spi0.spi.pociPin.$assign = "DIO12";
spi0.spi.picoPin.$assign = "DIO13";

var spi1 = SPI.addInstance();
spi1.$name = "CONFIG_SPI_AFE";
spi1.spi.sclkPin.$assign = "DIO7";
spi1.spi.pociPin.$assign = "DIO6";
spi1.spi.picoPin.$assign = "DIO5";

/* ======== NVS ======== */
var NVS = scripting.addModule("/ti/drivers/NVS");
var nvs = NVS.addInstance();
nvs.internalFlash.regionBase   = 0x48000;
nvs.internalFlash.regionSize   = 0x4000;
nvs.$name = "CONFIG_NVSINTERNAL";

/* ======== RF ======== */
var RF = scripting.addModule("/ti/drivers/RF");

/* if an antenna component exists, assign it to the rf instance */
if (system.deviceData.board && system.deviceData.board.components.RF) {
    RF.$hardware = system.deviceData.board.components.RF;
}

/* ======== POWER ======== */
var Power = scripting.addModule("/ti/drivers/Power");

if(lpName == "LP_CC2652RB")
{
  RF.xoscNeeded = false;
  Power.calibrateRCOSC_HF = false;
}

/* ======== TRNG ======== */
var TRNG = scripting.addModule("/ti/drivers/TRNG");
var trng = TRNG.addInstance();

/* ======== Device ======== */
var device = scripting.addModule("ti/devices/CCFG");
const ccfgSettings = system.getScript("/ti/common/lprf_ccfg_settings.js").ccfgSettings;
for(var setting in ccfgSettings)
{
    device[setting] = ccfgSettings[setting];
}

/* ======== RF Design ======== */
var rfDesign = scripting.addModule("ti/devices/radioconfig/rfdesign");
const rfDesignSettings = system.getScript("/ti/common/lprf_rf_design_settings.js").rfDesignSettings;
const rfDesignFallback = "LP_CC2674R10_RGZ";

for(var setting in rfDesignSettings)
{
    rfDesign[setting] = rfDesignSettings[setting];
}

if (!rfDesignSettings.rfDesign)
{
    rfDesign.rfDesign = rfDesignFallback;
}

const radioSettings = system.getScript("/ti/ble5stack/ble_common.js").getRadioScript(rfDesign.rfDesign,system.deviceData.deviceId);
const bleRfDesignSettings = radioSettings.rfDesignParams;
for(var setting in bleRfDesignSettings)
{
    rfDesign[setting] = bleRfDesignSettings[setting];
}

/* ======== BLE ======== */
var ble = scripting.addModule("/ti/ble5stack/ble");
ble.rfDesign = rfDesign.rfDesign;
ble.thorPg = 2;
ble.deviceRole = "PERIPHERAL_CFG";
ble.lockProject = true;
ble.deviceName = "BettermentBand";
ble.advSet2.advParam2.advType = "extended";
// Gap Advertising Flags
ble.advSet1.advData1.GAP_ADTYPE_FLAGS = true;
ble.advSet1.advData1.advertisingFlags = ["GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED","GAP_ADTYPE_FLAGS_GENERAL"];
// Shortened local name
ble.advSet1.advData1.GAP_ADTYPE_LOCAL_NAME_SHORT = true;
// Shortened Local Name
ble.advSet1.advData1.shortenedLocalName = "BBand";
// More 16-bit UUIDs available
ble.advSet1.advData1.GAP_ADTYPE_16BIT_MORE = true;
ble.advSet1.advData1.numOfUUIDs16More = 1;
ble.advSet1.advData1.UUID016More = 65520;
// Complete local name
ble.advSet1.scanRes1.GAP_ADTYPE_LOCAL_NAME_COMPLETE = true;
// Min and Max values of the connection interval - 2 octets Min, 2 octets Max (0xFFFF indicates no conn interval min or max)
const connIntervalRange = system.getScript("/ti/ble5stack/ble_common.js").getPeripheralConnIntervalRange();
ble.advSet1.scanRes1[connIntervalRange] = true;
// Min Connection Interval
ble.advSet1.scanRes1.minConnInterval = 100;
// Max Connection Interval
ble.advSet1.scanRes1.maxConnInterval = 130;
// TX Power Level
ble.advSet1.scanRes1.GAP_ADTYPE_POWER_LEVEL = true;


// Gap Advertising Flags
ble.advSet2.advData2.GAP_ADTYPE_FLAGS = true;
ble.advSet2.advData2.advertisingFlags = ["GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED","GAP_ADTYPE_FLAGS_GENERAL"];
// Shortened local name
ble.advSet2.advData2.GAP_ADTYPE_LOCAL_NAME_SHORT = true;
// Shortened Local Name
ble.advSet2.advData2.shortenedLocalName = "BBand";
// More 16-bit UUIDs available
ble.advSet2.advData2.GAP_ADTYPE_16BIT_MORE = true;
ble.advSet2.advData2.numOfUUIDs16More = 1;
ble.advSet2.advData2.UUID016More = 65520;

